app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def edit
      @school_class = SchoolClass.find(params[:id])

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "rubbish classes"], ["room_number", 2], ["updated_at", "2019-11-05 10:33:31.529050"], ["id", 1]]
---
    def update
      @school_class = SchoolClass.find(params[:id])
      @school_class.update(school_class_params)