app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (3) LIMIT ?  [["LIMIT", 1]]
---
    def edit
        @student = Student.find(params[:id])

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgenz"], ["updated_at", "2019-11-05 10:36:10.488613"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)